weedmanu/STM32_WIFI-WEB-MQTT-NTP_BY_ESP/STM32_WifiESP_MQTT.c
/**
 ******************************************************************************
 * @file    STM32_WifiESP_MQTT.c
 * @author  manu
 * @version 1.0.0
 * @date    2025
 * @brief   Implémentation des fonctions MQTT pour le module ESP01 WiFi.
 *
 * @details
 * Ce fichier contient l'implémentation des fonctions pour gérer la
 * communication MQTT (client) via un module ESP01 connecté à un
 * microcontrôleur STM32. Il propose des fonctions haut niveau pour la
 * connexion à un broker, la publication, la souscription, le ping,
 * la gestion des messages MQTT et le polling.
 *
 * @note
 * - Compatible STM32CubeIDE.
 * - Nécessite la bibliothèque STM32_WifiESP.h.
 *
 * @copyright
 * La licence de ce code est libre.
 ******************************************************************************
 */

// ==================== INCLUDES ====================
#include "STM32_WifiESP_MQTT.h"         // Header du module MQTT
#include "STM32_WifiESP.h"              // Fonctions de base ESP01
#include "STM32_WifiESP_WIFI.h"         // Fonctions WiFi ESP01
#include <string.h>                     // Fonctions de manipulation de chaînes
#include <stdio.h>                      // Fonctions d'entrée/sortie

// ==================== VARIABLES GLOBALES ====================
mqtt_client_t g_mqtt_client = {0};      // Instance globale du client MQTT
static mqtt_message_callback_t g_mqtt_cb = NULL; // Callback utilisateur pour réception de messages

// ==================== CONNEXION MQTT ====================
/**
 * @brief  Connexion au broker MQTT.
 * @param  broker_ip  Adresse IP du broker.
 * @param  port       Port du broker.
 * @param  client_id  Identifiant client.
 * @param  username   Nom d'utilisateur (optionnel, peut être NULL).
 * @param  password   Mot de passe (optionnel, peut être NULL).
 * @return ESP01_Status_t Code de retour (ESP01_OK si succès).
 */
ESP01_Status_t esp01_mqtt_connect(const char *broker_ip, uint16_t port, const char *client_id, const char *username, const char *password)
{
    ESP01_LOG_DEBUG("MQTT", "Connexion au broker %s:%u avec client_id=%s", broker_ip, port, client_id); // Log la tentative de connexion
    VALIDATE_PARAM(broker_ip && client_id, ESP01_INVALID_PARAM); // Vérifie les paramètres

    char cmd[ESP01_MAX_CMD_BUF], resp[ESP01_MAX_RESP_BUF]; // Buffers pour commandes et réponses
    ESP01_Status_t status;                                 // Statut de retour

    // Ouvre une connexion TCP vers le broker MQTT
    snprintf(cmd, sizeof(cmd), "AT+CIPSTART=\"TCP\",\"%s\",%u", broker_ip, port); // Prépare la commande AT+CIPSTART
    status = esp01_send_raw_command_dma(cmd, resp, sizeof(resp), "OK", ESP01_TIMEOUT_MEDIUM); // Envoie la commande
    ESP01_LOG_DEBUG("MQTT", "Réponse brute AT+CIPSTART : %s", resp); // Log la réponse brute
    if (status != ESP01_OK)
        return status; // Retourne en cas d'échec

    HAL_Delay(500); // Petite pause pour la stabilité

    // Construction du paquet MQTT CONNECT
    uint8_t mqtt_connect[ESP01_MAX_CMD_BUF]; // Buffer pour le paquet CONNECT
    uint16_t mqtt_len = 0;                   // Taille du paquet MQTT
    mqtt_connect[mqtt_len++] = 0x10;         // Type CONNECT

    uint16_t len_pos = mqtt_len++;           // Position du champ "remaining length"
    uint16_t var_len = 10;                   // Taille variable de base

    uint16_t client_id_len = strlen(client_id); // Longueur du client ID
    var_len += 2 + client_id_len;               // Ajoute la taille du client ID

    bool has_username = (username && strlen(username) > 0); // Indique si username présent
    uint16_t username_len = 0;
    if (has_username)
    {
        username_len = strlen(username); // Longueur du username
        var_len += 2 + username_len;     // Ajoute la taille du username
    }

    bool has_password = (password && strlen(password) > 0); // Indique si password présent
    uint16_t password_len = 0;
    if (has_password)
    {
        password_len = strlen(password); // Longueur du password
        var_len += 2 + password_len;     // Ajoute la taille du password
    }

    // Protocole MQTT
    mqtt_connect[mqtt_len++] = 0x00;     // Taille du nom du protocole (MSB)
    mqtt_connect[mqtt_len++] = 0x04;     // Taille du nom du protocole (LSB)
    mqtt_connect[mqtt_len++] = 'M';      // 'M'
    mqtt_connect[mqtt_len++] = 'Q';      // 'Q'
    mqtt_connect[mqtt_len++] = 'T';      // 'T'
    mqtt_connect[mqtt_len++] = 'T';      // 'T'
    mqtt_connect[mqtt_len++] = 0x04;     // Version 3.1.1

    uint8_t connect_flags = 0x02;        // Clean session
    if (has_username)
        connect_flags |= 0x80;           // Flag username
    if (has_password)
        connect_flags |= 0x40;           // Flag password
    mqtt_connect[mqtt_len++] = connect_flags; // Flags de connexion

    mqtt_connect[mqtt_len++] = 0x00;     // Keep alive MSB
    mqtt_connect[mqtt_len++] = 0x3C;     // Keep alive LSB (60s)

    // Client ID
    mqtt_connect[mqtt_len++] = (client_id_len >> 8) & 0xFF; // Taille client ID MSB
    mqtt_connect[mqtt_len++] = client_id_len & 0xFF;        // Taille client ID LSB
    memcpy(&mqtt_connect[mqtt_len], client_id, client_id_len); // Copie le client ID
    mqtt_len += client_id_len;

    // Username
    if (has_username)
    {
        mqtt_connect[mqtt_len++] = (username_len >> 8) & 0xFF; // Taille username MSB
        mqtt_connect[mqtt_len++] = username_len & 0xFF;        // Taille username LSB
        memcpy(&mqtt_connect[mqtt_len], username, username_len); // Copie le username
        mqtt_len += username_len;
    }

    // Password
    if (has_password)
    {
        mqtt_connect[mqtt_len++] = (password_len >> 8) & 0xFF; // Taille password MSB
        mqtt_connect[mqtt_len++] = password_len & 0xFF;        // Taille password LSB
        memcpy(&mqtt_connect[mqtt_len], password, password_len); // Copie le password
        mqtt_len += password_len;
    }

    // Encode la longueur variable MQTT
    if (var_len < 128)
    {
        mqtt_connect[len_pos] = var_len; // Longueur sur 1 octet
    }
    else
    {
        mqtt_connect[len_pos] = (var_len & 0x7F) | 0x80; // Longueur sur 2 octets (MSB)
        mqtt_connect[len_pos + 1] = var_len >> 7;        // LSB
        mqtt_len++;
    }

    // Prépare l'envoi du paquet MQTT CONNECT
    snprintf(cmd, sizeof(cmd), "AT+CIPSEND=%u", mqtt_len); // Prépare la commande AT+CIPSEND
    status = esp01_send_raw_command_dma(cmd, resp, sizeof(resp), ">", ESP01_TIMEOUT_SHORT); // Envoie la commande
    if (status != ESP01_OK)
        return status; // Retourne en cas d'échec

    ESP01_LOG_DEBUG("MQTT", "Envoi du paquet CONNECT (%d octets)", mqtt_len); // Log l'envoi du paquet
    for (int i = 0; i < mqtt_len; ++i)
    {
        ESP01_LOG_DEBUG("MQTT", ">>> TX[%03d]: %02X", i, mqtt_connect[i]); // Log chaque octet envoyé
    }

    HAL_UART_Transmit(g_esp_uart, mqtt_connect, mqtt_len, HAL_MAX_DELAY); // Envoie le paquet CONNECT

    status = esp01_wait_for_pattern("SEND OK", ESP01_TIMEOUT_SHORT); // Attend l'accusé d'envoi
    if (status != ESP01_OK)
        return status; // Retourne en cas d'échec

