weedmanu/STM32_WIFI-WEB-MQTT-NTP_BY_ESP/STM32_WifiESP_MQTT.c
    // Attente du CONNACK
    uint8_t rx_buf[ESP01_MAX_RESP_BUF]; // Buffer pour la réponse CONNACK
    memset(rx_buf, 0, sizeof(rx_buf));  // Initialise le buffer
    bool found_connack = false;         // Indicateur de réception CONNACK
    uint32_t start = HAL_GetTick();     // Timestamp de départ

    ESP01_LOG_DEBUG("MQTT", "=== Attente du CONNACK (timeout 10s) ==="); // Log attente CONNACK
    HAL_Delay(500); // Petite pause

    while ((HAL_GetTick() - start) < 10000 && !found_connack) // Boucle d'attente
    {
        uint16_t rx_len = esp01_get_new_data(rx_buf, sizeof(rx_buf)); // Récupère les nouvelles données
        if (rx_len > 0)
        {
            rx_buf[rx_len] = '\0'; // Termine la chaîne
            char *ipd_marker = strstr((char *)rx_buf, "+IPD,"); // Cherche le header IPD
            if (ipd_marker)
            {
                int ipd_payload_len_val;
                char *colon_ptr = strchr(ipd_marker, ':');
                char *first_comma_ptr = strchr(ipd_marker, ',');

                if (first_comma_ptr && colon_ptr && (colon_ptr > first_comma_ptr))
                {
                    if (sscanf(first_comma_ptr + 1, "%d", &ipd_payload_len_val) == 1)
                    {
                        uint8_t *mqtt_data_ptr = (uint8_t *)(colon_ptr + 1);
                        uint16_t actual_bytes_after_colon = rx_len - (mqtt_data_ptr - rx_buf);

                        if (actual_bytes_after_colon >= ipd_payload_len_val)
                        {
                            if (ipd_payload_len_val >= 4 && mqtt_data_ptr[0] == 0x20 && mqtt_data_ptr[1] == 0x02)
                            {
                                if (mqtt_data_ptr[3] == 0x00)
                                {
                                    ESP01_LOG_DEBUG("MQTT", "CONNACK OK (0x00) reçu"); // Log succès CONNACK
                                    found_connack = true;
                                }
                                else
                                {
                                    ESP01_LOG_ERROR("MQTT", "CONNACK Error Code: 0x%02X", mqtt_data_ptr[3]); // Log erreur CONNACK
                                    status = ESP01_CONNECTION_ERROR;
                                    found_connack = true;
                                }
                            }
                            else
                            {
                                ESP01_LOG_DEBUG("MQTT", ">>> IPD: Données reçues, mais pas un CONNACK valide ou trop court");
                            }
                        }
                        else
                        {
                            ESP01_LOG_DEBUG("MQTT", ">>> IPD: Payload incomplet, attente de plus de données");
                        }
                    }
                    else
                    {
                        ESP01_LOG_DEBUG("MQTT", ">>> IPD: Impossible de parser la longueur du header IPD");
                    }
                }
                else
                {
                    ESP01_LOG_DEBUG("MQTT", ">>> IPD: Header mal formé ou fragmenté");
                }
            }
        }
        if (!found_connack)
            HAL_Delay(100); // Petite pause si pas encore trouvé
    }

    if (found_connack)
    {
        ESP01_LOG_DEBUG("MQTT", "=== CONNACK détecté, connexion établie ==="); // Log succès
        status = ESP01_OK;
    }
    else
    {
        ESP01_LOG_WARN("MQTT", ">>> Aucun CONNACK détecté après 10 secondes"); // Log timeout
        ESP01_LOG_WARN("MQTT", ">>> Vérifiez la configuration du broker et les paramètres de connexion");
        status = ESP01_TIMEOUT;
    }

    if (status == ESP01_OK)
    {
        g_mqtt_client.connected = true; // Marque comme connecté
        strncpy(g_mqtt_client.broker_ip, broker_ip, sizeof(g_mqtt_client.broker_ip) - 1); // Sauvegarde l'IP du broker
        g_mqtt_client.broker_port = port; // Sauvegarde le port
        strncpy(g_mqtt_client.client_id, client_id, sizeof(g_mqtt_client.client_id) - 1); // Sauvegarde le client ID
        g_mqtt_client.keep_alive = 60; // Keepalive par défaut
        g_mqtt_client.packet_id = 1;   // Réinitialise le packet ID
        ESP01_LOG_DEBUG("MQTT", "=== Connexion établie avec succès ==="); // Log succès
    }
    else
    {
        ESP01_LOG_ERROR("MQTT", ">>> Échec de la connexion"); // Log échec
    }

    return status; // Retourne le statut final
}

// ==================== PUBLISH MQTT ====================
/**
 * @brief  Publication d'un message sur un topic.
 * @param  topic   Sujet (topic) du message.
 * @param  message Message à publier.
 * @param  qos     Qualité de service (0, 1 ou 2).
 * @param  retain  true pour conserver le message sur le broker, false sinon.
 * @return ESP01_Status_t Code de retour.
 */
ESP01_Status_t esp01_mqtt_publish(const char *topic, const char *message, uint8_t qos, bool retain)
{
    ESP01_LOG_DEBUG("MQTT", "Publication sur topic '%s', QoS=%d, retain=%d", topic, qos, retain); // Log la publication
    VALIDATE_PARAM(topic && message && qos <= 2, ESP01_INVALID_PARAM); // Vérifie les paramètres
    VALIDATE_PARAM(g_mqtt_client.connected, ESP01_FAIL); // Vérifie la connexion

    char cmd[ESP01_MAX_CMD_BUF], resp[ESP01_MAX_RESP_BUF]; // Buffers pour commandes et réponses
    ESP01_Status_t status;                                 // Statut de retour

    ESP01_LOG_DEBUG("MQTT", "=== Préparation publication ==="); // Log la préparation

    uint8_t mqtt_publish[ESP01_MQTT_MAX_PAYLOAD_LEN]; // Buffer pour le paquet MQTT PUBLISH
    uint16_t mqtt_len = 0;                            // Taille du paquet MQTT

    mqtt_publish[mqtt_len++] = 0x30 | (qos << 1) | (retain ? 1 : 0); // Header PUBLISH

    uint16_t topic_len = strlen(topic);     // Longueur du topic
    uint16_t message_len = strlen(message); // Longueur du message

    uint16_t var_len = 2 + topic_len; // Longueur variable (topic)
    if (qos > 0)
        var_len += 2;       // Ajoute Packet ID si QoS > 0
    var_len += message_len; // Ajoute la longueur du message

