weedmanu/STM32_WIFI-WEB-MQTT-NTP_BY_ESP/STM32_WifiESP_MQTT.c
    // Encodage de la longueur variable
    if (var_len < 128)
    {
        mqtt_publish[mqtt_len++] = var_len; // Longueur sur 1 octet
    }
    else
    {
        mqtt_publish[mqtt_len++] = (var_len & 0x7F) | 0x80; // Longueur sur 2 octets (MSB)
        mqtt_publish[mqtt_len++] = var_len >> 7;            // LSB
    }

    // Topic
    mqtt_publish[mqtt_len++] = (topic_len >> 8) & 0xFF; // Taille topic MSB
    mqtt_publish[mqtt_len++] = topic_len & 0xFF;        // Taille topic LSB
    memcpy(&mqtt_publish[mqtt_len], topic, topic_len);  // Copie le topic
    mqtt_len += topic_len;

    // Packet ID si QoS > 0
    if (qos > 0)
    {
        mqtt_publish[mqtt_len++] = (g_mqtt_client.packet_id >> 8) & 0xFF; // Packet ID MSB
        mqtt_publish[mqtt_len++] = g_mqtt_client.packet_id & 0xFF;        // Packet ID LSB
        g_mqtt_client.packet_id++;                                        // Incrémente le packet ID
    }

    // Message
    memcpy(&mqtt_publish[mqtt_len], message, message_len); // Copie le message
    mqtt_len += message_len;

    ESP01_LOG_DEBUG("MQTT", "=== Envoi paquet PUBLISH ==="); // Log l'envoi
    for (int i = 0; i < mqtt_len && i < 32; i++)
    {
        ESP01_LOG_DEBUG("MQTT", ">>> Byte %02X", mqtt_publish[i]); // Log chaque octet
    }

    snprintf(cmd, sizeof(cmd), "AT+CIPSEND=%u", mqtt_len); // Prépare la commande AT+CIPSEND
    status = esp01_send_raw_command_dma(cmd, resp, sizeof(resp), ">", ESP01_TIMEOUT_SHORT); // Envoie la commande
    if (status != ESP01_OK)
    {
        ESP01_LOG_WARN("MQTT", ">>> Échec préparation envoi"); // Log échec
        return status;
    }

    HAL_UART_Transmit(g_esp_uart, mqtt_publish, mqtt_len, HAL_MAX_DELAY); // Envoie le paquet MQTT

    status = esp01_wait_for_pattern("SEND OK", ESP01_TIMEOUT_MEDIUM); // Attend l'accusé d'envoi

    if (status == ESP01_OK)
    {
        ESP01_LOG_DEBUG("MQTT", "Message publié sur %s: %s", topic, message); // Log succès

        // Attente du PUBACK si QoS 1
        if (qos == 1)
        {
            uint8_t rx_buf[ESP01_SMALL_BUF_SIZE];
            bool found_puback = false;
            uint32_t start = HAL_GetTick();

            ESP01_LOG_DEBUG("MQTT", "=== Attente du PUBACK ==="); // Log attente PUBACK

            while ((HAL_GetTick() - start) < 2000 && !found_puback)
            {
                uint16_t rx_len = esp01_get_new_data(rx_buf, sizeof(rx_buf));
                if (rx_len > 0)
                {
                    for (uint16_t i = 0; i + 1 < rx_len; ++i)
                    {
                        if (rx_buf[i] == 0x40)
                        {
                            ESP01_LOG_DEBUG("MQTT", ">>> PUBACK reçu"); // Log succès PUBACK
                            found_puback = true;
                            break;
                        }
                    }
                }
                HAL_Delay(50);
            }

            if (!found_puback)
            {
                ESP01_LOG_WARN("MQTT", ">>> Pas de PUBACK reçu"); // Log absence PUBACK
            }
        }
    }
    else
    {
        ESP01_LOG_ERROR("MQTT", "Échec de la publication"); // Log échec
    }

    return status; // Retourne le statut
}

// ==================== SUBSCRIBE MQTT ====================
/**
 * @brief  Souscription à un topic.
 * @param  topic Sujet (topic) à souscrire.
 * @param  qos   Qualité de service souhaitée.
 * @return ESP01_Status_t Code de retour.
 */
ESP01_Status_t esp01_mqtt_subscribe(const char *topic, uint8_t qos)
{
    ESP01_LOG_DEBUG("MQTT", "Souscription au topic '%s', QoS=%d", topic, qos); // Log la souscription
    VALIDATE_PARAM(topic && qos <= 2, ESP01_INVALID_PARAM); // Vérifie les paramètres
    VALIDATE_PARAM(g_mqtt_client.connected, ESP01_FAIL);    // Vérifie la connexion

    char cmd[ESP01_MAX_CMD_BUF], resp[ESP01_MAX_RESP_BUF]; // Buffers pour commandes et réponses
    ESP01_Status_t status;                                 // Statut de retour

    uint8_t mqtt_subscribe[ESP01_MAX_CMD_BUF]; // Buffer pour le paquet MQTT SUBSCRIBE
    uint16_t mqtt_len = 0;                     // Taille du paquet

    mqtt_subscribe[mqtt_len++] = 0x82;         // Header SUBSCRIBE

    uint16_t len_pos = mqtt_len++;             // Position du champ "remaining length"

    // Packet ID
    mqtt_subscribe[mqtt_len++] = g_mqtt_client.packet_id >> 8; // Packet ID MSB
    mqtt_subscribe[mqtt_len++] = g_mqtt_client.packet_id & 0xFF; // Packet ID LSB
    g_mqtt_client.packet_id++;                                  // Incrémente le packet ID

    // Topic
    uint16_t topic_len = strlen(topic);                         // Longueur du topic
    mqtt_subscribe[mqtt_len++] = topic_len >> 8;                // Taille topic MSB
    mqtt_subscribe[mqtt_len++] = topic_len & 0xFF;              // Taille topic LSB
    memcpy(&mqtt_subscribe[mqtt_len], topic, topic_len);        // Copie le topic
    mqtt_len += topic_len;

    mqtt_subscribe[mqtt_len++] = qos;                           // QoS

    mqtt_subscribe[len_pos] = mqtt_len - 2;                     // Encode la longueur variable

    snprintf(cmd, sizeof(cmd), "AT+CIPSEND=%u", mqtt_len);      // Prépare la commande AT+CIPSEND
    status = esp01_send_raw_command_dma(cmd, resp, sizeof(resp), ">", ESP01_TIMEOUT_SHORT); // Envoie la commande
    if (status != ESP01_OK)
        return status;                                          // Retourne en cas d'échec

    HAL_UART_Transmit(g_esp_uart, mqtt_subscribe, mqtt_len, HAL_MAX_DELAY); // Envoie le paquet MQTT

    status = esp01_wait_for_pattern("SEND OK", ESP01_TIMEOUT_SHORT); // Attend l'accusé d'envoi

    if (status == ESP01_OK)
    {
        ESP01_LOG_DEBUG("MQTT", "Abonnement au topic %s réussi", topic); // Log succès
    }
    else
    {
        ESP01_LOG_ERROR("MQTT", "Échec de l'abonnement"); // Log échec
    }

    return status; // Retourne le statut
}

// ==================== PING MQTT ====================
/**
 * @brief  Envoie un ping MQTT (PINGREQ).
 * @return ESP01_Status_t Code de retour.
 */
ESP01_Status_t esp01_mqtt_ping(void)
{
    ESP01_LOG_DEBUG("MQTT", "Envoi PINGREQ"); // Log l'envoi du ping
    if (!g_mqtt_client.connected)
        return ESP01_FAIL; // Vérifie la connexion

    char cmd[ESP01_MAX_CMD_BUF], resp[ESP01_MAX_RESP_BUF]; // Buffers pour commandes et réponses
    ESP01_Status_t status;                                 // Statut de retour

