weedmanu/STM32_WIFI-WEB-MQTT-NTP_BY_ESP/STM32_WifiESP_MQTT.c
    ESP01_LOG_DEBUG("MQTT", "=== Envoi PINGREQ (keepalive) ==="); // Log la préparation

    uint8_t mqtt_pingreq[2];
    mqtt_pingreq[0] = 0xC0; // Header PINGREQ
    mqtt_pingreq[1] = 0x00; // Longueur

    snprintf(cmd, sizeof(cmd), "AT+CIPSEND=%u", 2); // Prépare la commande AT+CIPSEND
    status = esp01_send_raw_command_dma(cmd, resp, sizeof(resp), ">", ESP01_TIMEOUT_SHORT); // Envoie la commande
    if (status != ESP01_OK)
    {
        ESP01_LOG_WARN("MQTT", ">>> Échec préparation envoi PINGREQ"); // Log échec
        return status;
    }

    HAL_UART_Transmit(g_esp_uart, mqtt_pingreq, 2, HAL_MAX_DELAY); // Envoie le paquet PINGREQ

    status = esp01_wait_for_pattern("SEND OK", ESP01_TIMEOUT_SHORT); // Attend l'accusé d'envoi

    if (status == ESP01_OK)
    {
        ESP01_LOG_DEBUG("MQTT", "=== PINGREQ envoyé avec succès ==="); // Log succès

        uint8_t rx_buf[ESP01_SMALL_BUF_SIZE];
        bool found_pingresp = false;
        uint32_t start = HAL_GetTick();

        while ((HAL_GetTick() - start) < 2000 && !found_pingresp)
        {
            uint16_t rx_len = esp01_get_new_data(rx_buf, sizeof(rx_buf));
            if (rx_len > 0)
            {
                for (uint16_t i = 0; i + 1 < rx_len; ++i)
                {
                    if (rx_buf[i] == 0xD0 && rx_buf[i + 1] == 0x00)
                    {
                        ESP01_LOG_DEBUG("MQTT", "PINGRESP reçu"); // Log succès PINGRESP
                        found_pingresp = true;
                        break;
                    }
                }
            }
            HAL_Delay(50);
        }

        if (!found_pingresp)
        {
            ESP01_LOG_ERROR("MQTT", "Pas de PINGRESP reçu"); // Log absence PINGRESP
        }
    }
    else
    {
        ESP01_LOG_WARN("MQTT", ">>> Échec de l'envoi du PINGREQ"); // Log échec
    }

    return status; // Retourne le statut
}

// ==================== DECONNEXION MQTT ====================
/**
 * @brief  Déconnexion du broker MQTT.
 * @return ESP01_Status_t Code de retour.
 */
ESP01_Status_t esp01_mqtt_disconnect(void)
{
    ESP01_LOG_DEBUG("MQTT", "Déconnexion du broker MQTT"); // Log la déconnexion
    char resp[ESP01_MAX_RESP_BUF]; // Buffer pour la réponse
    if (esp01_send_raw_command_dma("AT+CIPCLOSE", resp, sizeof(resp), "OK", 3000) == ESP01_OK || strstr(resp, "CLOSED"))
    {
        return ESP01_OK; // Déconnexion réussie
    }
    return ESP01_TIMEOUT; // Timeout ou erreur
}

// ==================== CALLBACK MESSAGE MQTT ====================
/**
 * @brief  Définit le callback utilisateur pour la réception de messages MQTT.
 * @param  cb Fonction callback à appeler lors de la réception d'un message.
 */
void esp01_mqtt_set_message_callback(mqtt_message_callback_t cb)
{
    ESP01_LOG_DEBUG("MQTT", "Callback message MQTT enregistré"); // Log l'enregistrement du callback
    g_mqtt_cb = cb; // Enregistre le callback utilisateur
}

// ==================== POLLING MQTT ====================
/**
 * @brief  Fonction de polling MQTT à appeler régulièrement pour traiter les messages entrants.
 */
void esp01_mqtt_poll(void)
{
    uint8_t buffer[ESP01_MAX_RESP_BUF];                        // Buffer temporaire pour les nouvelles données
    uint16_t len = esp01_get_new_data(buffer, sizeof(buffer)); // Récupère les nouvelles données UART
    if (len > 0)
    {
        if (g_acc_len + len < sizeof(g_accumulator) - 1)
        {
            memcpy(g_accumulator + g_acc_len, buffer, len); // Ajoute au buffer accumulateur
            g_acc_len += len;
            g_accumulator[g_acc_len] = '\0';
        }
        else
        {
            g_acc_len = 0;
            g_accumulator[0] = '\0';
            ESP01_LOG_ERROR("MQTT", "Débordement de l'accumulateur MQTT"); // Log débordement
            return;
        }
    }

    // Traitement des paquets MQTT dans l'accumulateur
    while (1)
    {
        char *ipd_start = strstr(g_accumulator, "+IPD,"); // Cherche le début d'un paquet IPD
        if (!ipd_start)
            break;

        char *colon_pos = strchr(ipd_start, ':'); // Cherche le séparateur
        if (!colon_pos)
            break;

        int payload_len = 0;
        char *len_ptr = ipd_start + 5;
        if (sscanf(len_ptr, "%d", &payload_len) != 1)
        {
            ESP01_LOG_WARN("MQTT", "Impossible de parser la longueur du +IPD"); // Log parsing échoué
            break;
        }

        int ipd_start_offset = ipd_start - g_accumulator;
        int ipd_total_len = (colon_pos - ipd_start) + 1 + payload_len;

        if (g_acc_len - ipd_start_offset < ipd_total_len)
        {
            ESP01_LOG_DEBUG("MQTT", "Attente suite: ipd_start_offset=%d, g_acc_len=%d, ipd_total_len=%d",
                            ipd_start_offset, g_acc_len, ipd_total_len); // Log attente suite
            break;
        }

        uint8_t *payload = (uint8_t *)(colon_pos + 1);

        // Décodage d'un paquet PUBLISH MQTT
        if (payload_len > 4 && payload[0] == 0x30 && g_mqtt_cb)
        {
            uint16_t topic_len = (payload[2] << 8) | payload[3];
            if (topic_len + 4 < payload_len && topic_len < 64)
            {
                char topic_buf[ESP01_MQTT_MAX_TOPIC_LEN] = {0};
                memcpy(topic_buf, &payload[4], topic_len); // Copie le topic
                int msg_len = payload_len - 4 - topic_len;
                if (msg_len > (ESP01_MQTT_MAX_PAYLOAD_LEN - 1))
                    msg_len = ESP01_MQTT_MAX_PAYLOAD_LEN - 1;
                char msg_buf[ESP01_MQTT_MAX_PAYLOAD_LEN] = {0};
                memcpy(msg_buf, &payload[4 + topic_len], msg_len); // Copie le message
                msg_buf[msg_len] = 0;
                g_mqtt_cb(topic_buf, msg_buf); // Appelle le callback utilisateur
                ESP01_LOG_DEBUG("MQTT", "Paquet PUBLISH reçu sur topic '%s', message='%s'", topic_buf, msg_buf); // Log réception
            }
            else
            {
                ESP01_LOG_WARN("MQTT", "Paquet PUBLISH mal formé ou topic/message trop long"); // Log erreur format
            }
        }

        // Retire le paquet traité de l'accumulateur
        int total_to_remove = ipd_start_offset + ipd_total_len;
        if (g_acc_len > total_to_remove)
        {
            memmove(g_accumulator, g_accumulator + total_to_remove, g_acc_len - total_to_remove); // Décale le buffer
            g_acc_len -= total_to_remove;
            g_accumulator[g_acc_len] = '\0';
        }
        else
        {
            g_acc_len = 0;
            g_accumulator[0] = '\0';
        }
    }
}
